FV2504/E_0590.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.23.3: AD: Bestellung zur Stammdatenänderung an LF (verantwortlich)</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0590</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> MSB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Stimmen alle Stammdaten für Verwendungszeiträume, welche mit „Im System vorhandene Daten“ gekennzeichnet sind, sowie Verwendungszeiträume welche mit „Im System keine Daten vorhanden“ gekennzeichnet sind, mit dem beim Verantwortlichen vorliegenden Stammdaten überein?<BR align="left"/>Hinweis:<BR align="left"/>Dies ist für jeden in der Anfrage vorhandenen Verwendungszeitraum jeweils für den gesamten Zeitraum zu prüfen.<BR align="left"/>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Sind in der Bestellung der Stammdatenänderung Verwendungszeiträume der Daten mit dem Code „Erwartete Daten“ und / oder „Keine Daten erwartet“ enthalten?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: keine Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit: <BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein. <BR align="left"/>- Es wurden keine Stammdaten zur Änderung angegeben. <BR align="left"/>Eine Stammdatenänderung wird nicht versendet.<BR align="left"/></FONT>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Kommt der Verantwortliche zu dem Ergebnis, dass er Änderungen an seinen Stammdaten vornimmt?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.<BR align="left"/>- Änderungen an den Stammdaten werden vorgenommen. <BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: keine Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.<BR align="left"/>- Änderungen an den Stammdaten werden nicht vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird nicht versendet.<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Sind in der Bestellung der Stammdatenänderung der Stammdatenänderung Verwendungszeiträume der Daten mit dem Code „Erwartete Daten“ und / oder „Keine Daten erwartet“ enthalten?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit: <BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein. <BR align="left"/>- Es wurden keine Stammdaten zur Änderung angegeben. <BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Kommt der Verantwortliche zu dem Ergebnis, dass er Änderungen an seinen Stammdaten vornimmt?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.<BR align="left"/>- Änderungen an den Stammdaten werden vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit: <BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.<BR align="left"/>- Änderungen an den Stammdaten werden nicht vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "20" [label="Ja"];
    "10" -> "40" [label="Nein"];
    "20" -> "A01" [label="Nein"];
    "20" -> "30" [label="Ja"];
    "30" -> "A02" [label="Ja"];
    "30" -> "A03" [label="Nein"];
    "40" -> "A04" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "50" -> "A05" [label="Ja"];
    "50" -> "A06" [label="Nein"];

    bgcolor="transparent";
}
